# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\fneves\Documents\PSoC Creator\wp_1\engine_speed_sensor.cydsn\engine_speed_sensor.cyprj
# Date: Fri, 17 Feb 2017 01:07:39 GMT
#set_units -time ns
create_clock -name {engine_sensor_adc_intUabClock(FFB)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/ff_div_13}] [get_pins {ClockBlock/ff_div_14}]]
create_clock -name {engine_sensor_adc_intSarClock(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_12}]]
create_clock -name {engine_sensor_uart_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {engine_sensor_adc_intUabClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {engine_sensor_adc_intSarClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {engine_sensor_uart_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]


# Component constraints for C:\Users\fneves\Documents\PSoC Creator\wp_1\engine_speed_sensor.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\fneves\Documents\PSoC Creator\wp_1\engine_speed_sensor.cydsn\engine_speed_sensor.cyprj
# Date: Fri, 17 Feb 2017 01:07:36 GMT
